---
kind: method
id: M:Autodesk.Revit.DB.Analysis.FieldValues.#ctor(Autodesk.Revit.DB.Analysis.FieldValues)
source: html/b425b3a4-b4d7-24a1-4e24-eaec47b9acba.htm
---
# Autodesk.Revit.DB.Analysis.FieldValues.#ctor Method

Creates a copy of the given FieldValues instance.

## Syntax (C#)
```csharp
public FieldValues(
	FieldValues otherObject
)
```

## Parameters
- **otherObject** (`Autodesk.Revit.DB.Analysis.FieldValues`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null